#define USECPERTICK 50

#include <SchooMyUtilities.h>
#include <IRremote.h>

SchooMyUtilities scmUtils = SchooMyUtilities();

IRsend irsend_10(10);

void setup() {
  Serial.begin(9600);
  pinMode(19, INPUT);
  pinMode(15, INPUT);
}

void loop() {
  bool sw1 = (!digitalRead(19) == 1);
  bool sw2 = (!digitalRead(15) == 1);

  Serial.println(!digitalRead(19));

  if (sw1 && sw2) {
    // 両方同時押し → バック
    uint16_t rawData_back[] = {9000,4400,600,500,650,500,650,500,600,550,600,550,600,500,650,500,650,500,650,1600,650,1600,650,1600,600,1650,600,1600,650,1600,650,1600,650,1600,600,1650,600,500,650,1600,650,500,650,1600,650,500,600,550,600,550,600,550,600,1600,650,500,650,1650,600,500,650,1600,600,1600,650,1600,650};
    irsend_10.sendRaw(rawData_back, sizeof(rawData_back) / sizeof(rawData_back[0]), 38);
    delay(500);

  } else if (sw1) {
    // スイッチ1のみ → 前進など
    uint16_t rawData_10_40e39ec4[] = {9000,4350,650,450,650,500,700,450,650,500,650,500,650,500,650,500,650,500,650,1600,600,1600,650,1600,650,1600,650,1600,600,1650,600,1600,650,1600,650,500,650,1600,600,1650,600,500,650,500,650,500,650,1600,650,500,650,1600,600,550,600,550,650,1600,600,1650,600,1600,650,500,650,1600,650};
    irsend_10.sendRaw(rawData_10_40e39ec4, sizeof(rawData_10_40e39ec4) / sizeof(rawData_10_40e39ec4[0]), 38);
    delay(100);

  } else if (sw2) {
    // スイッチ2のみ → 右折など
    uint16_t rawData_10_2a331bab[] = {9000,4350,650,500,650,450,700,450,700,450,700,450,650,500,650,500,650,500,650,1600,650,1600,650,1550,700,1550,650,1600,650,1600,650,1550,700,1550,650,500,650,500,650,1600,650,500,650,500,650,500,650,1550,700,450,700,1550,650,1600,650,500,650,1600,650,1600,600,1600,650,500,650,1600,650};
    irsend_10.sendRaw(rawData_10_2a331bab, sizeof(rawData_10_2a331bab) / sizeof(rawData_10_2a331bab[0]), 38);
    delay(300);
  }
}
